trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИспользованиеРабочихУчастков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТекущийОтветственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НастройкаАдресногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РозничныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекущаяДолжностьОтветственного</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьОперативныеОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыРасходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПересчетовТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПриходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УчетныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСкладскиеПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияСкладскихПомещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СкладДляБухгалтерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеРазрешеноРедактированиеЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подотчетник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b6b1d28-2274-4089-bbe0-1f892b513c41">
    <name>Транзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31714690-5baf-46f1-b063-d29c311537f8">
    <name>ТорговыйЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6da19460-b28a-45da-95fc-40a81653f323">
    <name>СкрытьКоличествоУчетаВПересчетах</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="efdd8d42-ae41-4592-8382-d99891278ded">
    <name>ТипСкладаПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ad05e83-cd86-4595-b1cd-604ad5d18c31">
    <name>ДопСкладПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc9d13f0-85a3-4086-9203-6e34b242f14b">
    <name>ОтправкаУведомлений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3d49e10-572c-4e29-a20e-727c92be2a9e">
    <name>ПовторноеУведомление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57e1c5a7-2f3b-451e-b301-5b891fe6cb38">
    <name>ТелефонПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="682997ea-3be2-4a30-8770-7535fef1dbdd">
    <name>EMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6500dc86-8583-4657-936f-1ccc78a87015">
    <name>ДопEMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93e0d2a6-ba2b-4dd6-9aa3-ef4cbd740848">
    <name>УведомлятьВБитриксОПоступлениях</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d5793ec-4952-45ae-ba13-3ea772eca4ae">
    <name>УведомлятьВБитриксОСписанииПодотчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2354dc18-0c64-42c5-8971-6e5307b195f6">
    <name>ИндивидуальныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/CommonModules/СкладыВызовСервера/Module.bsl
&ИзменениеИКонтроль("СкладыОбработкаПолученияДанныхВыбора")
Процедура Док_СкладыОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт

	Перем ВыборГруппыСкладов, Дата, Склад,
		ИспользоватьОрдернуюСхемуПриОтгрузке,
		ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач,
		ИспользоватьОрдернуюСхемуПриПоступлении, ПодразделениеКладовой;
	
	// Проверяем и извлекаем параметры в переменные
	//	если передан хоть один обрабатываемый параметр - не используем стандартную обработку.
	СтандартнаяОбработка = НЕ Параметры.Свойство("ВыборГруппыСкладов", ВыборГруппыСкладов);
	СтандартнаяОбработка = НЕ Параметры.Свойство("Склад", Склад) И СтандартнаяОбработка;
	Если Параметры.Отбор.Свойство("ДатаНачалаОрдернойСхемыПриОтгрузке", Дата)
		ИЛИ Параметры.Отбор.Свойство("ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач", Дата)
		ИЛИ Параметры.Отбор.Свойство("ДатаНачалаОрдернойСхемыПриПоступлении", Дата) 
		ИЛИ Параметры.Свойство("ПодразделениеКладовой", Дата) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПоиска = Параметры.СтрокаПоиска;
	Если СтрокаПоиска = Неопределено Тогда
		СтрокаПоиска = "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.Ссылка          КАК Склад,
	|	Склады.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Наименование ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""
	|";
	#Вставка
	Если Параметры.Свойство("ДокументПродажи") Тогда
		Если Параметры.ДокументПродажи Тогда
			ТекстЗапроса = "ВЫБРАТЬ
			|	Склады.Ссылка КАК ЗакрытыйСклад
			|ПОМЕСТИТЬ ВТЗакрытыеСкладыПродажи
			|ИЗ
			|	Справочник.Склады КАК Склады
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|		ПО (Склады.Подразделение = ДополнительныеСведения.Объект)
			|ГДЕ
			|	Склады.СкладПродажи
			|	И ДополнительныеСведения.Свойство.имя = ""ДатаЗакрытия_8c881506063c4217817d168e23a0d486""	
			|		И ДополнительныеСведения.Значение<&ТекущаяДата;
			|////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Склады.Ссылка          КАК Склад,
			|	Склады.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Справочник.Склады КАК Склады
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|		ПО (Склады.Подразделение = ДополнительныеСведения.Объект)
			|ГДЕ
			|	Склады.Наименование ПОДОБНО &СтрокаПоиска
			|";
		КонецЕсли;
	КонецЕсли;
	#КонецВставки
	
	// При наличии отбора по ордерной схеме необходимо учитывать дату начала использования ордерной схемы.
	Если Параметры.Отбор.Свойство("ИспользоватьОрдернуюСхемуПриОтгрузке",
			ИспользоватьОрдернуюСхемуПриОтгрузке) Тогда
		ТекстУсловия = "
			|Склады.ИспользоватьОрдернуюСхемуПриОтгрузке";
		Если Параметры.Отбор.Свойство("ДатаНачалаОрдернойСхемыПриОтгрузке")
			И ЗначениеЗаполнено(Дата) Тогда
			ТекстУсловия = ТекстУсловия + "
				|И &Дата >= Склады.ДатаНачалаОрдернойСхемыПриОтгрузке";
		КонецЕсли;
		Если НЕ ИспользоватьОрдернуюСхемуПриОтгрузке
			И ЗначениеЗаполнено(Дата) Тогда
			ТекстУсловия = "НЕ (" + ТекстУсловия +")";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " И " + ТекстУсловия;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач",
			ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач) Тогда
		ТекстУсловия = "
			|Склады.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач";
		Если Параметры.Отбор.Свойство("ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач")
			И ЗначениеЗаполнено(Дата) Тогда
			ТекстУсловия = ТекстУсловия + "
				|И &Дата >= Склады.ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач";
		КонецЕсли;
		Если НЕ ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
			ТекстУсловия = "НЕ (" + ТекстУсловия +")";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " И " + ТекстУсловия;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ИспользоватьОрдернуюСхемуПриПоступлении",
			ИспользоватьОрдернуюСхемуПриПоступлении) Тогда
		ТекстУсловия = "
				|Склады.ИспользоватьОрдернуюСхемуПриПоступлении";
		Если Параметры.Отбор.Свойство("ДатаНачалаОрдернойСхемыПриПоступлении") Тогда
			ТекстУсловия = ТекстУсловия + "
				|И &Дата >= Склады.ДатаНачалаОрдернойСхемыПриПоступлении";
		КонецЕсли;
		Если НЕ ИспользоватьОрдернуюСхемуПриПоступлении
			И ЗначениеЗаполнено(Дата) Тогда
			ТекстУсловия = "НЕ (" + ТекстУсловия +")";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " И " + ТекстУсловия;
	КонецЕсли;
	
	Если Параметры.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
			|	И Склады.ЭтоГруппа";
	ИначеЕсли Параметры.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
			|	И НЕ Склады.ЭтоГруппа";
	КонецЕсли;
	#Вставка
	Если Параметры.свойство("ДокументПродажи") Тогда
		Если Параметры.ДокументПродажи Тогда
			ТекстЗапроса = ТекстЗапроса + "
				|	И Склады.СкладПродажи
				|	И НЕ Склады.Ссылка В (ВЫБРАТЬ
				|							  ВТЗакрытыеСкладыПродажи.ЗакрытыйСклад
				|						  ИЗ
				|							  ВТЗакрытыеСкладыПродажи КАК ВТЗакрытыеСкладыПродажи)";
		КонецЕсли;
	КонецЕсли;
	#КонецВставки

	// Если, например, в шапке Заказа выбрана группа складов, то при выборе склада в ТЧ нужно выбрать подчиненные.
	Если ЗначениеЗаполнено(Склад) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
			|	И Склады.Ссылка В ИЕРАРХИИ(&Склад)
			|	И Склады.ВыборГруппы В (&ВыборГруппыСкладов)";
	
	ИначеЕсли ЗначениеЗаполнено(ВыборГруппыСкладов) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
			|	И (НЕ Склады.ЭтоГруппа
			|	ИЛИ Склады.ВыборГруппы В (&ВыборГруппыСкладов))";
	КонецЕсли;
	
	Если Параметры.Свойство("ПодразделениеКладовой", ПодразделениеКладовой) Тогда
		ТекстЗапроса = ТекстЗапроса + "
			|	И (НЕ Склады.ЦеховаяКладовая
			|	ИЛИ Склады.Подразделение = &ПодразделениеКладовой)";
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса + "
	|	УПОРЯДОЧИТЬ ПО Склады.Наименование";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СтрокаПоиска", ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(СтрокаПоиска) + "%");
	Запрос.УстановитьПараметр("ВыборГруппыСкладов", ВыборГруппыСкладов);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ПодразделениеКладовой", ПодразделениеКладовой);
	#Вставка
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	#КонецВставки

	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеВыбора = Новый СписокЗначений();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураВыбора = Новый Структура("Значение", Выборка.Склад);
			Если Выборка.ПометкаУдаления Тогда
				СтруктураВыбора.Вставить("ПометкаУдаления", Выборка.ПометкаУдаления);
			КонецЕсли;
			ДанныеВыбора.Добавить(СтруктураВыбора);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
